import Card from "../components/common/Cards";


export default function ExperienceSection() {
	return (
		<>
		<Card title="경력" subtitle="샤이닝 라이언 인턴십 | 2025.06 ~ 2025.07" delay={800} >
			- 멋쟁이사자처럼 신사업 서비스 기여<br/>
			- 추후 서비스 고도화를 위한 기반 설계 및 마련<br/>
			- 실사용서비스 운영 및 사용자 테스트<br/>
			- 라이언커넥트 연동을 통한 트래픽 유도<br/>
			<br/>
			[ 회복기 재활 병원   | 2023.05 ~ 2024.05 ]<br/>
			- 의사, 간호사, 보호자 등의 다양한 이해관계자와의 원활한 소통 및 협업<br/>
			- 팀 내 구성원과의 적극적인 커뮤니케이션을 바탕으로 협력적인 업무 환경 조성 및 목표 달성 기여<br/>
			- EMR(전자의무기록) 등의 병원 정보 시스템을 활용하여 환자 데이터셋의 체계적인 관리 및 처리<br/>
		</Card>	
		</>
	)
}

