import Card from "../components/common/Cards";


export default function TrainingSection() {
	return (
		<>
			<Card title="교육" subtitle="멋쟁이 사자처럼" delay={700}>
				
				실무에서 바로 쓸 수 있는 웹 개발 역량을 갖추기 위해 부트캠프에 참여했습니다.<br/> 실습과 프로젝트 중심 교육을 통해 실제 개발 프로세스를 경험하였습니다.<br/>
				<br/>
[프론트엔드와 백엔드의 통합적 이해]<br/>
사용자 경험과 인터페이스 설계의 중요성을 체감하였습니다. 이후 팀 프로젝트를 통해 <br/>데이터베이스 연동, 인증, API 개발 등 웹 서비스의 핵심 기능을 직접 구현하며 프론트엔드와 백엔드의 연결 구조를 이해하였습니다.<br/>
<br/>
[클라우드 및 배포 경험]<br/>
AWS, Docker, Kubernetes 등 클라우드 환경에서의 서비스 배포를 경험하였습니다.<br/> 또한, 서비스 운영 실습을 통해 개발된 웹 서비스를 실제 환경에 적용하는 전 과정을 경험하였습니다.<br/>
<br/>
[프로젝트 기반 실전 경험]<br/>
헬스케어 수업관리 서비스, 이커머스 쇼핑몰 등 다양한 팀/개인 프로젝트를 수행하였습니다.<br/>
또한, 요구사항 분석부터 설계, 개발, 배포, 운영까지 전 과정을 직접 주도하였습니다.<br/> 해커톤과 데모데이 등 협업과 발표를 경험하였습니다.<br/>
<br/>
-  프로젝트 경험을 통해 웹 개발의 전 과정을 주도적으로 수행할 수 있는 역량을 갖추었습니다.<br/>
- 프론트엔드와 백엔드, 클라우드 등 다양한 기술 스택을 익혀, 다양한 역할을 수행할 수 있습니다.<br/>
			</Card>
		</>
	)
}

